Revit 2018 API
Rebar.GetShapeId Method
 Returns the id of the RebarShape element that defines the shape of the rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2009
Syntax
C#
public ElementId GetShapeId()
Visual Basic
Public Function GetShapeId As ElementId
Visual C++
public:
ElementId^ GetShapeId()
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace